БухЭксп/Documents/CW_ЗакрытиеГрузоперевозки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>CW_ЗакрытиеГрузоперевозки</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.CW_ПеревыставлениеПоСтавкам</xr:Item>
				<xr:Item>AccumulationRegister.CW_ВознаграждениеПоГрузоперевозкам</xr:Item>
				<xr:Item>AccumulationRegister.CW_ДоходыПоГрузоперевозкам</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Организации</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Контрагенты</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ДоговорыПоГрузоперевозкам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Аналитика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_Заказы</v8:Type>
						<v8:Type>cfg:CatalogRef.CW_Грузоперевозки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗакрытиеПоЗаказу</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>(Общ) </Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодробноеПредставлениеНоменклатуры</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормируетсяАкт</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерАкта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаАкта</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВедомыйДокумент</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормируетсяСчетФактура</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСчетаФактуры</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСчетаФактуры</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВедомыйСчетФактура</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СчетФактураВыданный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаРасходов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДоходов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнаяКорректировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПриложениеКДоговору</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ПриложенияКДоговорам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодСпособаВыставления</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Вознаграждение</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Грузоперевозка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CW_Грузоперевозки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.CW_Номенклатура</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НоменклатурнаяГруппа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НоменклатурныеГруппы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.CW_СтавкаНДС</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Всего</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Расходы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Грузоперевозка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CW_Грузоперевозки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.CW_Номенклатура</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.CW_СтавкаНДС</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Всего</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РасходыПоГрузоперевозке</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.CW_РасходыПоГрузоперевозке</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Доходы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Грузоперевозка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CW_Грузоперевозки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.CW_Номенклатура</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.CW_СтавкаНДС</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Всего</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоходыПоГрузоперевозке</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.CW_ДоходыПоГрузоперевозке</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

БухЭксп/Enums/CW_ПорядокПрисвоенияИсходящихНомеров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>CW_ПорядокПрисвоенияИсходящихНомеров</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СплошнаяНумерация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВПределахДаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НезависимаяНумерация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВПределахДатыАктыНезависимые</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнешнийНумератор</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

БухЭксп/Documents/CW_ЗакрытиеГрузоперевозки/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Перем ДС Экспорт;

// ---------------------------------------------------------------------------- 

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	CW_Документы.ЗаполнениеДокументов(ЭтотОбъект);
	
	Исполнитель 	= CW_Настройки.ПолучитьФизЛицоПользователя(Ответственный);
	
	Если ДанныеЗаполнения = Неопределено Тогда 
		
		Возврат;
		
	Иначе
		
		АналитикаЗаполнения = _сф.ст_ПолучитьСвойство(ДанныеЗаполнения,"Аналитика");
		Если АналитикаЗаполнения <> Неопределено Тогда
			
			Если ТипЗнч(АналитикаЗаполнения)=Тип("СправочникСсылка.CW_Заказы") Тогда
				
				_сф.ст_УстановитьСвойство(ДанныеЗаполнения,"ЗакрытиеПоЗаказу",Истина);
				
			КонецЕсли; 
			
		КонецЕсли; 
		
	КонецЕсли;
	
КонецПроцедуры

// --- 

Процедура ПриКопировании(ОбъектКопирования)
	
	Дата = CW_Документы.РабочееВремя();
	
	ВедомыйДокумент = Документы.РеализацияТоваровУслуг.ПустаяСсылка();
	ВедомыйСчетФактура = Документы.СчетФактураВыданный.ПустаяСсылка();
	// --- 
	НомерАкта="";
	ДатаАкта = Дата(1,1,1);
	// --- 
	НомерСчетаФактуры="";
	ДатаСчетаФактуры = Дата(1,1,1)
	
КонецПроцедуры

// --- 

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	
	ПорядокПрисвоенияНомеров = CW_Настройки.ПараметрУчетнойПолитики(Дата,Организация,"ПорядокПрисвоенияНомеров");
	
	Если ПорядокПрисвоенияНомеров = Перечисления.CW_ПорядокПрисвоенияИсходящихНомеров.ВПределахДаты ИЛИ
		ПорядокПрисвоенияНомеров = Перечисления.CW_ПорядокПрисвоенияИсходящихНомеров.ВПределахДатыАктыНезависимые Тогда
		Префикс = Строка(Организация.Префикс)+Строка(Формат(Дата,"ДФ=ММ"))+ Строка(Формат(Дата,"ДФ=dd"))+"-";
	ИначеЕсли ПорядокПрисвоенияНомеров = Перечисления.CW_ПорядокПрисвоенияИсходящихНомеров.СплошнаяНумерация Тогда
		Префикс = CW_Документы.ПрефиксОрганизации(Организация);
	Иначе
		Префикс = CW_Документы.ПрефиксОрганизации(Организация);
	КонецЕсли;
	
КонецПроцедуры

// --- 

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если (ОбменДанными.Загрузка) Тогда 	Возврат; КонецЕсли;
	
	Грузоперевозка = Аналитика;
	
	ПроверяемыеРеквизиты.Очистить();
	
	// проверка реквизитов...
	//-----------------------
	флОшибка = Ложь;
	МассивСообщений = Новый Массив;
	
	Если Организация.Пустая() Тогда
		флОшибка = Истина;
		МассивСообщений.Добавить("Не указана организация!");
	КонецЕсли; 
	
	Если Контрагент.Пустая() Тогда
		флОшибка = Истина;
		МассивСообщений.Добавить("Не указан контрагент!");
	КонецЕсли; 
	
	Если Договор.Пустая() Тогда
		флОшибка = Истина;
		МассивСообщений.Добавить("Не указан договор контрагента!");
	КонецЕсли;
	
	Если Грузоперевозка.Пустая() Тогда
		флОшибка = Истина;
		МассивСообщений.Добавить("Не указана грузоперевозка!");
	КонецЕсли;
	
	СтруктураПараметров = CW_Настройки.ПустаяСтруктураПолученияПараметровДоговора();
	СтруктураПараметров.Дата 				= Дата;
	СтруктураПараметров.Договор 			= Договор;
	СтруктураПараметров.ПриложениеКДоговору = ПриложениеКДоговору;
	
	ПараметрыДоговора	= CW_Настройки.ПолучитьПараметрыДоговора(СтруктураПараметров, "Номенклатура");
	
	Для каждого Стр Из Вознаграждение Цикл
		
		Если Стр.Номенклатура.Пустая() Тогда
			флОшибка = Истина;
			МассивСообщений.Добавить("В строке №"+Стр.НомерСтроки+" таблицы вознаграждения не указана номенклатура вознаграждения!");
		КонецЕсли;
		
		Если Стр.Количество = 0 Тогда
			флОшибка = Истина;
			МассивСообщений.Добавить("В строке №"+Стр.НомерСтроки+" таблицы Вознаграждение не указано количество!");
		КонецЕсли;
		
		Если Стр.Цена = 0 Тогда
			флОшибка = Истина;
			МассивСообщений.Добавить("В строке №"+Стр.НомерСтроки+" таблицы Вознаграждение не указана цена!");
		КонецЕсли;
		
		Если Стр.Сумма = 0 Тогда
			флОшибка = Истина;
			МассивСообщений.Добавить("В строке №"+Стр.НомерСтроки+" таблицы Вознаграждение не указана сумма!");
		КонецЕсли;
		
		Если Стр.СтавкаНДС.Пустая() Тогда
			флОшибка = Истина;
			МассивСообщений.Добавить("В строке №"+Стр.НомерСтроки+" таблицы Вознаграждение не указана ставка НДС!");
		КонецЕсли;
		
		Если Стр.НДС = 0 И Стр.СтавкаНДС <> Перечисления.СтавкиНДС.БезНДС И Стр.СтавкаНДС <> Перечисления.СтавкиНДС.НДС0 Тогда
			флОшибка = Истина;
			МассивСообщений.Добавить("В строке №"+Стр.НомерСтроки+" таблицы Вознаграждение не указана сумма НДС!");
		КонецЕсли;
		
		Если Стр.Всего = 0 Тогда
			флОшибка = Истина;
			МассивСообщений.Добавить("В строке №"+Стр.НомерСтроки+" таблицы Вознаграждение не указана сумма всего!");
		КонецЕсли;
		
	КонецЦикла;
	
	Для каждого Стр Из Доходы Цикл
		
		Если Стр.Номенклатура.Пустая() Тогда
			флОшибка = Истина;
			МассивСообщений.Добавить("В строке №"+Стр.НомерСтроки+" таблицы Доходы не указана номенклатура услуги!");
		КонецЕсли;
		
		Если Стр.Сумма = 0 Тогда
			флОшибка = Истина;
			МассивСообщений.Добавить("В строке №"+Стр.НомерСтроки+" таблицы Доходы не указана сумма!");
		КонецЕсли;
		
		Если Стр.СтавкаНДС.Пустая() Тогда
			флОшибка = Истина;
			МассивСообщений.Добавить("В строке №"+Стр.НомерСтроки+" таблицы Доходы не указана ставка НДС!");
		КонецЕсли;
		
		Если Стр.НДС = 0 И Стр.СтавкаНДС <> Перечисления.СтавкиНДС.БезНДС И Стр.СтавкаНДС <> Перечисления.СтавкиНДС.НДС0 Тогда
			флОшибка = Истина;
			МассивСообщений.Добавить("В строке №"+Стр.НомерСтроки+" таблицы Доходы не указана сумма НДС!");
		КонецЕсли;
		
		Если Стр.Всего = 0 Тогда
			флОшибка = Истина;
			МассивСообщений.Добавить("В строке №"+Стр.НомерСтроки+" таблицы Доходы не указана сумма всего!");
		КонецЕсли;
		
		Если Стр.ДоходыПоГрузоперевозке.Пустая() Тогда
			флОшибка = Истина;
			МассивСообщений.Добавить("В строке №"+Стр.НомерСтроки+" таблицы Доходы не указана сумма всего!");
		КонецЕсли;
		
	КонецЦикла;
	
	Для каждого Стр Из Расходы Цикл
		
		Если Стр.Номенклатура.Пустая() Тогда
			флОшибка = Истина;
			МассивСообщений.Добавить("В строке №"+Стр.НомерСтроки+" таблицы Расходы не указана номенклатура вознаграждения!");
		КонецЕсли;
		
		Если Стр.Сумма = 0 Тогда
			флОшибка = Истина;
			МассивСообщений.Добавить("В строке №"+Стр.НомерСтроки+" таблицы Расходы не указана сумма!");
		КонецЕсли;
		
		Если Стр.СтавкаНДС.Пустая() Тогда
			флОшибка = Истина;
			МассивСообщений.Добавить("В строке №"+Стр.НомерСтроки+" таблицы Расходы не указана ставка НДС!");
		КонецЕсли;
		
		Если Стр.НДС = 0 И Стр.СтавкаНДС <> Перечисления.СтавкиНДС.БезНДС И Стр.СтавкаНДС <> Перечисления.СтавкиНДС.НДС0 Тогда
			флОшибка = Истина;
			МассивСообщений.Добавить("В строке №"+Стр.НомерСтроки+" таблицы Расходы не указана сумма НДС!");
		КонецЕсли;
		
		Если Стр.Всего = 0 Тогда
			флОшибка = Истина;
			МассивСообщений.Добавить("В строке №"+Стр.НомерСтроки+" таблицы Расходы не указана сумма всего!");
		КонецЕсли;
		
		Если Стр.РасходыПоГрузоперевозке.Пустая() Тогда
			флОшибка = Истина;
			МассивСообщений.Добавить("В строке №"+Стр.НомерСтроки+" таблицы Расходы не указана сумма всего!");
		КонецЕсли; 
		
	КонецЦикла;
	
	Если флОшибка Тогда
		
		Для каждого Стр Из МассивСообщений Цикл
			Сообщить(Стр,СтатусСообщения.Внимание);
		КонецЦикла; 
		
		Отказ = Истина;
		Возврат;
		
	КонецЕсли; 
	
КонецПроцедуры

// ---------------------------------------------------------------------------- 

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	_сф.ст_УстановитьСвойство(ДополнительныеСвойства,"СтатусПроведенияДоПроведения", Проведен);
	
	//Для версии КОРП
	ВестиУчетПоПодразделениям = ПолучитьФункциональнуюОпцию("ВестиУчетПоПодразделениям");
	//Для версии КОРП
	
	// проверка прав
	Если НЕ CW_ПраваДоступа.ПравоДоступно("РедактированиеФинансов") Тогда
		Отказ = Истина;
		Сообщить("Недостаточно прав");
		Возврат;
	КонецЕсли;
	
	// обмен данными
	Если (ОбменДанными.Загрузка) Тогда 
		Возврат; 
	КонецЕсли;

	// фиксируем режим записи
	_сф.ст_УстановитьСвойство(ДополнительныеСвойства,"РежимЗаписи",РежимЗаписи);
	
	// контроль наличия общих параметров
	Если НЕ ЗаполненыОбщиеПараметры() Тогда 
		СформироватьОбщиеПараметры(,Ложь); 
	КонецЕсли; 
	
	//Реквизит пишем, так как он может быть использован в других запросах модуля.
	ФормируетсяАкт = Истина;
	
	СтруктураПараметровБухУчета = Новый Структура;
	СтруктураПараметровБухУчета.Вставить("Договор", 				Договор);
	СтруктураПараметровБухУчета.Вставить("ПриложениеКДоговору",		ПриложениеКДоговору);
	
	ПараметрыБухгалтерскогоУчета = CW_Финансы.ПолучитьПарметрыВеденияБухгалтерскогоУчета(СтруктураПараметровБухУчета, Дата);
	
	// контроль порядка отражения
	Если ПараметрыБухгалтерскогоУчета.БухгалтерскийУчет И ФормируетсяСчетФактура Тогда
		CW_Финансы.ПредупреждениеПоСхемеУчетаПеревыставленияПоСтавкам(ЭтотОбъект);	
	КонецЕсли; 
	
	ВалютаРегламентированногоУчетаРубль = ПолучитьФункциональнуюОпцию("CW_ВалютаРегламентированногоУчетаРубль");
	
	Если ВалютаРегламентированногоУчетаРубль тогда
		СуммаДокумента 	= _сф.Итог(Вознаграждение,"Всего");
		СуммаНДС		= _сф.Итог(Вознаграждение,"НДС");
	КонецЕсли;
	
	СуммаРасходов 	= _сф.Итог(Расходы,"Всего");
	СуммаДоходов 	= _сф.Итог(Доходы,"Всего");
	
	_сф.УстановитьЕслиНезаполнено(Ответственный,ПараметрыСеанса.ТекущийПользователь);
	
	ПолитикаНумерации 					= ДС.УП.ПорядокПрисвоенияНомеров;  
	
	// если номер документ пустой - устанавливаем
	Если СокрЛП(Номер) = ""
		Тогда	
		УстановитьНовыйНомер();	
	КонецЕсли; 
	
	// --- 
	
	Если (РежимЗаписи <> РежимЗаписиДокумента.ОтменаПроведения) Тогда
		
		// для внешнего нумератора
		Если ПолитикаНумерации = Перечисления.CW_ПорядокПрисвоенияИсходящихНомеров.ВнешнийНумератор Тогда
			
			ОбработкаНумерации = _ПО.ПолучитьОбработку(ДС.УП.ВнешнийНумератор);
			
		КонецЕсли;
		
		// проверяем номера
		Если НЕ ПроверкаНомеров() Тогда 
			Отказ = Истина; 
			Возврат; 
		КонецЕсли;
		
		Если (ФормируетсяАкт) Тогда
			
			_сф.УстановитьЕслиНезаполнено(ДатаАкта,Дата);
			
			Если ПараметрыБухгалтерскогоУчета.БухгалтерскийУчет Тогда
				
				ТребуетсяСозданиеВедомого = Ложь;
				Если ВедомыйДокумент.Пустая() Тогда
					
					ТребуетсяСозданиеВедомого = Истина;
					
				КонецЕсли; 
				
				Если НЕ ТребуетсяСозданиеВедомого Тогда
					Если НЕ _СФ.ОбъектБДСуществует(ВедомыйДокумент) Тогда
						ТребуетсяСозданиеВедомого = Истина;
					КонецЕсли; 
				КонецЕсли; 
				
				Если ТребуетсяСозданиеВедомого Тогда
					НовыйВедомый = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
				Иначе
					НовыйВедомый = ВедомыйДокумент.ПолучитьОбъект();
					НовыйВедомый.ПометкаУдаления = Ложь;
				КонецЕсли; 
				
				НовыйВедомый.ОбменДанными.Загрузка=Истина;
				НовыйВедомый.Организация = Организация;
				НовыйВедомый.Дата 		= ДатаАкта;
				
				//Для версии КОРП
				Если ВестиУчетПоПодразделениям Тогда
					НовыйВедомый.ПодразделениеОрганизации = ПодразделениеОрганизации;
				КонецЕсли;	
				//Для версии КОРП
				
				Если ЗначениеЗаполнено(НомерАкта) Тогда
					НовыйВедомый.Номер = НомерАкта;
				Иначе
					
					// для "сплошной" и "в пределах даты" ставим номер документа
					Если ПолитикаНумерации = Перечисления.CW_ПорядокПрисвоенияИсходящихНомеров.СплошнаяНумерация
						ИЛИ ПолитикаНумерации = Перечисления.CW_ПорядокПрисвоенияИсходящихНомеров.ВПределахДаты Тогда
						
						НовыйВедомый.Номер = СокрЛП(Номер);
						// --- 
						НомерАкта = Номер;
						
					КонецЕсли; 
					
					// для независимой просто получаем номер
					Если ПолитикаНумерации = Перечисления.CW_ПорядокПрисвоенияИсходящихНомеров.НезависимаяНумерация Тогда
						
						НовыйВедомый.УстановитьНовыйНомер();
						// --- 
						НомерАкта = НовыйВедомый.Номер;
						
					КонецЕсли;
					
					// внешний нумератор
					Если (ПолитикаНумерации = Перечисления.CW_ПорядокПрисвоенияИсходящихНомеров.ВнешнийНумератор) Тогда
						
						ОбработкаНумерации.УстановитьНомерАкта(ЭтотОбъект,НовыйВедомый);
						НомерАкта = НовыйВедомый.Номер;
						
					КонецЕсли; 
					
				КонецЕсли; 

				CW_Документы.ПеренестиПризнакВосстановленияПоследовательности(ЭтотОбъект,НовыйВедомый);

				Отказ = CW_Документы.ПроверкаНомера(НовыйВедомый, РежимЗаписиДокумента.Запись, ЭтотОбъект, Ложь);
				Если Отказ Тогда 
					Возврат; 
				КонецЕсли; 
				
				ВедомыйДокумент = НовыйВедомый.Ссылка;
				
				Если ФормируетсяСчетФактура Тогда
					
					Если ВедомыйСчетФактура.Пустая() Тогда
						ВедомыйСФ = CW_Финансы.НайтиВыданнуюСчетФактуру(ВедомыйДокумент);
						Если ВедомыйСФ <> Неопределено Тогда
							ВедомыйСчетФактура = ВедомыйСФ;
							Если (НЕ ЗначениеЗаполнено(НомерСчетаФактуры)) Тогда
								НомерСчетаФактуры = ВедомыйСчетФактура.Номер;
								ДатаСчетаФактуры = ВедомыйСчетФактура.Дата;
							КонецЕсли; 
						КонецЕсли; 
					КонецЕсли; 
					
					Если (ВедомыйСчетФактура.Пустая()) Тогда
						
						_сф.УстановитьЕслиНезаполнено(ДатаСчетаФактуры,ДатаАкта);
						
						НовыйСФ = Документы.СчетФактураВыданный.СоздатьДокумент();
						НовыйСФ.ВидСчетаФактуры=Перечисления.ВидСчетаФактурыВыставленного.НаРеализацию;
						НовыйСФ.Организация = Организация;
						НовыйСФ.Дата = ДатаСчетаФактуры;
						// --- 
						НовыйСФ.ДокументыОснования.Очистить();
						НовыйСФ.ДокументыОснования.Добавить().ДокументОснование = ВедомыйДокумент;
						НовыйСФ.ДокументОснование = ВедомыйДокумент;
						// --- 
						НовыйСФ.Выставлен = Истина;
						НовыйСФ.КодСпособаВыставления = КодСпособаВыставления;
						НовыйСФ.ОпределениеПараметровСчетаФактурыНаРеализацию();
						// --- 
						НовыйСФ.ОбменДанными.Загрузка=Истина;
						
						Если (ЗначениеЗаполнено(НомерСчетаФактуры)) Тогда
							
							НовыйСФ.Номер = НомерСчетаФактуры;
							
						Иначе
							
							// для "сплошной" и "в пределах даты" ставим номер документа
							Если (ПолитикаНумерации = Перечисления.CW_ПорядокПрисвоенияИсходящихНомеров.СплошнаяНумерация
								ИЛИ ПолитикаНумерации = Перечисления.CW_ПорядокПрисвоенияИсходящихНомеров.ВПределахДаты) Тогда
								
								НомерСчетаФактуры = Номер;
								НовыйСФ.Номер = НомерСчетаФактуры;
								
							ИначеЕсли (ПолитикаНумерации = Перечисления.CW_ПорядокПрисвоенияИсходящихНомеров.НезависимаяНумерация) Тогда 
								
								НовыйСФ.УстановитьНовыйНомер();
								НомерСчетаФактуры = НовыйСФ.Номер;
								
								// внешний нумератор
							ИначеЕсли (ПолитикаНумерации = Перечисления.CW_ПорядокПрисвоенияИсходящихНомеров.ВнешнийНумератор) Тогда
								
								ОбработкаНумерации.УстановитьНомерСчетаФактуры(ЭтотОбъект, НовыйСФ);
								НомерСчетаФактуры = НовыйСФ.Номер;
								
							КонецЕсли; 
							
						КонецЕсли; 
						
						CW_Документы.ПеренестиПризнакВосстановленияПоследовательности(ЭтотОбъект,НовыйСФ);
						Отказ = CW_Документы.ПроверкаНомера(НовыйСФ, РежимЗаписиДокумента.Запись, ЭтотОбъект,Ложь);
						Если Отказ Тогда Возврат; КонецЕсли;
						ВедомыйСчетФактура = НовыйСФ.Ссылка;
						
					КонецЕсли; 
					
				КонецЕсли; 
				
			Иначе
				
				Если НЕ ЗначениеЗаполнено(НомерАкта) Тогда
					
					Если НЕ ЗначениеЗаполнено(НомерАкта) Тогда
						
						// для "сплошной" и "в пределах даты" ставим номер документа
						Если ПолитикаНумерации = Перечисления.CW_ПорядокПрисвоенияИсходящихНомеров.СплошнаяНумерация
							ИЛИ ПолитикаНумерации = Перечисления.CW_ПорядокПрисвоенияИсходящихНомеров.ВПределахДаты 
							ИЛИ ПолитикаНумерации = Перечисления.CW_ПорядокПрисвоенияИсходящихНомеров.ВнешнийНумератор Тогда
							
							НомерАкта = Номер;
							
						Иначе
							
							Сообщить("Автонумерация актов для договоров без признака бухгалтерского учёта поддерживается только для типов нумерации ""Сплошная"" и ""В пределах даты""");
							Отказ = Истина;
							Возврат;
							
						КонецЕсли; 
						
					КонецЕсли; 
					
				КонецЕсли; 
				
				Если НЕ ВедомыйДокумент.Пустая() Тогда
					Ведомый = ВедомыйДокумент.ПолучитьОбъект();
					Ведомый.УстановитьПометкуУдаления(Истина);
				КонецЕсли; 
				
				Если ФормируетсяСчетФактура Тогда
					
					_сф.УстановитьЕслиНезаполнено(ДатаСчетаФактуры,ДатаАкта);
					
					// установка номера счета-фактуры
					Если НЕ ЗначениеЗаполнено(НомерСчетаФактуры) Тогда
						
						// для "сплошной" и "в пределах даты" ставим номер документа
						Если (ПолитикаНумерации = Перечисления.CW_ПорядокПрисвоенияИсходящихНомеров.СплошнаяНумерация
							ИЛИ ПолитикаНумерации = Перечисления.CW_ПорядокПрисвоенияИсходящихНомеров.ВПределахДаты) Тогда
							
							НомерСчетаФактуры = Номер;
							
						КонецЕсли; 
						
					КонецЕсли;  // присвоение номера счета-фактуры
					
					Если НЕ ВедомыйСчетФактура.Пустая() Тогда
						ВедомыйСФ = ВедомыйСчетФактура.ПолучитьОбъект();
						_сф.ст_УстановитьСвойство(ВедомыйСФ.ДополнительныеСвойства,"СообщитьОбИзмененииРеквизитов",Ложь);
						ВедомыйСФ.УстановитьПометкуУдаления(Истина);
					КонецЕсли; 
					
				КонецЕсли; 
				
			КонецЕсли; 
			
		Иначе
			
			Если НЕ ВедомыйДокумент.Пустая() Тогда
				Ведомый = ВедомыйДокумент.ПолучитьОбъект();
				Ведомый.УстановитьПометкуУдаления(Истина);
			КонецЕсли; 
			
		КонецЕсли; 
		
		Если НЕ Отказ Тогда  
			ПарамтерыНомераАкта = Новый Структура("Организация, Номер, Дата", Организация, НомерАкта, ДатаАкта);
			ТекущийНомерАкта 	= CW_Документы.ПолучитьНомерНаПечать(ПарамтерыНомераАкта);  
			
			ПараметрыНомераСЧФ  = Новый Структура("Организация, Номер, Дата", Организация, НомерСчетаФактуры, ДатаСчетаФактуры);
		    ТекущийНомерСФ 		= CW_Документы.ПолучитьНомерНаПечать(ПараметрыНомераСЧФ);
			
			ШаблонПредставления 	= "Акт №%1 от %2;  С/Ф №%3 от %4"; 
			ПредставлениеДокумента 	= СтрШаблон(ШаблонПредставления,
												ТекущийНомерАкта,
												Формат(ДатаАкта, "ДФ=dd.MM.yy"),
												ТекущийНомерСФ,
												Формат(ДатаСчетаФактуры, "ДФ=dd.MM.yy"));
			
		КонецЕсли;
		
	КонецЕсли; 
	
	
КонецПроцедуры


Процедура ПриЗаписи(Отказ)

	// контроль загрузки
	Если ОбменДанными.Загрузка 
		Или РучнаяКорректировка Тогда 
		Возврат; 
	КонецЕсли;
	
	// контроль наличия общих параметров
	Если НЕ ЗаполненыОбщиеПараметры() Тогда 
		СформироватьОбщиеПараметры(,Ложь); 
	КонецЕсли; 
	
	ВалютаРегламентированногоУчетаРубль = ПолучитьФункциональнуюОпцию("CW_ВалютаРегламентированногоУчетаРубль");
	
	//проверяем на ввод начальных остатков...
	//---------------------------------------
	ДатаНачалаВеденияУчета = CW_Настройки.ПолучитьДатуНачалаВеденияУчета(Организация);
	Если НЕ ДатаНачалаВеденияУчета = Неопределено Тогда
		РежимВводначальныхОстатков = Ложь;		
		Если Дата < ДатаНачалаВеденияУчета Тогда		
			РежимВводначальныхОстатков = Истина;
		Иначе
			РежимВводначальныхОстатков = Ложь;
		КонецЕсли;
	Иначе
		РежимВводначальныхОстатков = Ложь;
	КонецЕсли;
	
	Если РежимВводначальныхОстатков Тогда
		Сообщить("Дата документа меньше даты начала ведения учета! Документ не может быть проведен!", СтатусСообщения.Важное);
		Отказ = Истина;
		Возврат;
	КонецЕсли; 
	
	РежимЗаписи = _сф.ст_ПолучитьСвойство(ДополнительныеСвойства,"РежимЗаписи");
	Если РежимЗаписи = РежимЗаписиДокумента.Запись Тогда
		Возврат;
	КонецЕсли;

	Если РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
		// проверяем возможность отмены проведения
		Если НЕ ПроверитьЗакрытиеГрузоперевозок() Тогда
			Сообщить("В документе присутствуют закрытие грузоперевозки. Операция отменена.",СтатусСообщения.Важное);
			Отказ = Истина;
			Возврат;
		КонецЕсли;
		
		Если НЕ ВедомыйДокумент.Пустая() Тогда
			ВедомыйОбъект = ВедомыйДокумент.ПолучитьОбъект();
			Если ВедомыйОбъект <> Неопределено Тогда
				_сф.ст_УстановитьСвойство(ВедомыйОбъект.ДополнительныеСвойства,"ВедущийДокумент",Ссылка);
				ВедомыйОбъект.УстановитьПометкуУдаления(ПометкаУдаления);
				Отказ = CW_Документы.ПроверкаНомера(ВедомыйОбъект, РежимЗаписи, ЭтотОбъект.Ссылка ,Ложь);
				Если Отказ Тогда 
					Возврат; 
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		Для каждого Набор Из Движения Цикл
			Набор.Прочитать();
			Набор.Очистить();
		КонецЦикла;
		Движения.Записать();
		
		Возврат;
	КонецЕсли;
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		
		Если ВалютаРегламентированногоУчетаРубль тогда
			Если Вознаграждение.Количество() = 0 Тогда
				Сообщить("Проведение незаполненного документа не допускается.");
				Отказ = Истина;
				Возврат;
			КонецЕсли; 
		КонецЕсли;
		
		Если Договор.Закрыт 
			И КонецДня(Договор.ДатаЗакрытия) < Дата Тогда
			Отказ = Истина;
			Сообщить(Ссылка);
			Сообщить("Проведение документа позднее даты закрытия договора с контрагентом невозможно!");
			Возврат;
		КонецЕсли; 
		
		ОчищатьДвижения = Истина;
		
		СтруктураПараметровБухУчета = Новый Структура;
		СтруктураПараметровБухУчета.Вставить("Договор", 				Договор);
		СтруктураПараметровБухУчета.Вставить("ПриложениеКДоговору",		ПриложениеКДоговору);
		
		ПараметрыБухгалтерскогоУчета = CW_Финансы.ПолучитьПарметрыВеденияБухгалтерскогоУчета(СтруктураПараметровБухУчета, Дата);
		
		// удаляем собственные движения	
		Если ПараметрыБухгалтерскогоУчета.БухгалтерскийУчет И ФормируетсяАкт Тогда
			Если НЕ ВедомыйДокумент.РучнаяКорректировка Тогда
				ОчищатьДвижения = Истина;
			Иначе 
				СтатусПроведенияДоПроведения = _сф.ст_ПолучитьСвойство(ДополнительныеСвойства,"СтатусПроведенияДоПроведения",Ложь);
				Если НЕ СтатусПроведенияДоПроведения Тогда
					Сообщить(Ссылка);
					Сообщить("Ведомый документ содержит признак ручной корректировки. Проведение заблокировано.");
					Отказ = Истина;
					Возврат;
				Иначе	
					Сообщить("Внимание! У ведомого документа "+Строка(ВедомыйДокумент)+" установлен признак ручной корректировки движений!");
					ОчищатьДвижения = Ложь;
					// ничего не делаем
				КонецЕсли; 
			КонецЕсли; 
		КонецЕсли; 
		
		Если ОчищатьДвижения Тогда
			Для каждого Набор Из Движения Цикл
				Набор.Прочитать();
				Набор.Очистить();
			КонецЦикла;
			Движения.Записать();
		Иначе
			Возврат;
		КонецЕсли; 
		
		Если ПараметрыБухгалтерскогоУчета.БухгалтерскийУчет Тогда
			
			Счета = CW_Конфигурация.ПланСчетов();
			
			ПараметрыУчетнойПолитики = CW_Настройки.ПараметрыУчетнойПолитики(Дата, Организация);
			
			СвояОрганизацияВКачествеПокупателя 	= ПараметрыУчетнойПолитики.СвояОрганизацияВКачествеПокупателя;
			СвояОрганизацияКонтрагент 			= ПараметрыУчетнойПолитики.СвояОрганизацияКонтрагент;
			СвояОрганизацияДоговорКонтрагента 	= ПараметрыУчетнойПолитики.СвояОрганизацияДоговорКонтрагента;   
			
			ВедомыйОбъект = ВедомыйДокумент.ПолучитьОбъект();
			ВедомыйОбъект.УстановитьПометкуУдаления(ПометкаУдаления);

			_сф.ст_УстановитьСвойство(ВедомыйОбъект.ДополнительныеСвойства,"ВедущийДокумент",Ссылка);
			_сф.ст_УстановитьСвойство(ВедомыйОбъект.ДополнительныеСвойства,"ЗависимоеПроведение",Истина);

			ВедомыйОбъект.ВидОперации=Перечисления.ВидыОперацийРеализацияТоваров.ПродажаКомиссия;
			ВедомыйОбъект.Организация = Организация; 
			
			Если СвояОрганизацияВКачествеПокупателя Тогда
				ВедомыйОбъект.Контрагент 		= СвояОрганизацияКонтрагент;
				ВедомыйОбъект.ДоговорКонтрагента = СвояОрганизацияДоговорКонтрагента;
			Иначе
				ВедомыйОбъект.Контрагент		 = Контрагент;
				ВедомыйОбъект.ДоговорКонтрагента = ПараметрыБухгалтерскогоУчета.ДоговорДляВыявленияФинансовогоРезультата;
			Конецесли;
		
			//ВедомыйОбъект.УчитыватьНДС = Истина;
			ВедомыйОбъект.СуммаВключаетНДС = Ложь;
			ВедомыйОбъект.ВалютаДокумента = ДС.КО.ВалютаРегламентированногоУчета;
			ВедомыйОбъект.КратностьВзаиморасчетов = 1;
			ВедомыйОбъект.КурсВзаиморасчетов = 1;
			
			СчетУчетаРасчетов = РегистрыСведений.CW_УчетнаяПолитика.ПолучитьСчетаУчетаРасчетов(Организация, 
																								ПараметрыБухгалтерскогоУчета.ВалютаДоговора, 
																								ПараметрыБухгалтерскогоУчета.ВзаиморасчетыВУЕ, 
																								Дата);
			
			ВедомыйОбъект.СчетУчетаРасчетовСКонтрагентом 	= СчетУчетаРасчетов; 
			ВедомыйОбъект.СчетУчетаРасчетовПоАвансам 		= СчетУчетаРасчетов; 
			
			ВедомыйОбъект.СпособЗачетаАвансов = Перечисления.СпособыЗачетаАвансов.НеЗачитывать;
			ОсновноеПодразделение = Неопределено;
			ВедомыйОбъект.Ответственный = Ответственный;
			
			ВедомыйОбъект.Услуги.Очистить();
			Для каждого СтрТЧ Из Вознаграждение Цикл
				
				Нстр = ВедомыйОбъект.Услуги.Добавить();
				Нстр.Номенклатура = СтрТЧ.Номенклатура;
				Нстр.Содержание = СокрЛП(СтрТЧ.Представление);
				Нстр.Количество = СтрТЧ.Количество;
				Нстр.Цена = СтрТЧ.Цена;
				Нстр.Сумма = СтрТЧ.Сумма;
				Нстр.СтавкаНДС = СтрТЧ.СтавкаНДС;
				Нстр.СуммаНДС = СтрТЧ.НДС;
				Нстр.СчетДоходов = Счета.ВыручкаНеЕНВД; // 90.01.1
				Нстр.Субконто = СтрТЧ.НоменклатурнаяГруппа; // номенклатурная группа
				Нстр.СчетРасходов = Счета.СебестоимостьПродажНеЕНВД; // 90.02.1
				Нстр.СчетУчетаНДСПоРеализации = Счета.Продажи_НДС; // 90.03
				
			КонецЦикла;
			
			CW_Документы.ПеренестиПризнакВосстановленияПоследовательности(ЭтотОбъект,ВедомыйОбъект);
			Отказ = CW_Документы.ПроверкаНомера(ВедомыйОбъект, РежимЗаписи, ЭтотОбъект.Ссылка,Ложь);
			Если Отказ Тогда 
				Возврат; 
			КонецЕсли;
			
			Если НЕ ФормируетсяСчетФактура 
				И ЗначениеЗаполнено(ВедомыйСчетФактура) Тогда
				ВедомыйСФ = ВедомыйСчетФактура.ПолучитьОбъект();
				ВедомыйСФ.УстановитьПометкуУдаления(Истина);
			КонецЕсли; 
			
		КонецЕсли; 
		
	КонецЕсли;
			
КонецПроцедуры			

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	// обмен данными
	Если ОбменДанными.Загрузка Тогда 
		Возврат; 
	КонецЕсли;
	
	Если РучнаяКорректировка Тогда 
		Возврат; 
	КонецЕсли; 
	
	// контроль наличия общих параметров
	CW_БухгалтерияЭкспедитораСервер.УстановитьОбщиеПараметрыПроведенияДокументов();

	Если НЕ ЗаполненыОбщиеПараметры() Тогда 
		СформироватьОбщиеПараметры(,Ложь); 
	КонецЕсли; 

	ПараметрыДоговора = ДС.ПД;
	
	ТЗСвертка = _сф.т_Создать("Грузоперевозка,Номенклатура,СтавкаНДС,НДС,Сумма,Всего");
	Для каждого Стр Из Расходы Цикл
		НовСтрока = ТЗСвертка.Добавить();
		НовСтрока.Грузоперевозка 	= Стр.Грузоперевозка;
		НовСтрока.Номенклатура 		= Стр.Номенклатура;
		НовСтрока.СтавкаНДС 		= Стр.СтавкаНДС;
		НовСтрока.НДС 				= Стр.НДС;
		НовСтрока.Сумма 			= Стр.Сумма;
		НовСтрока.Всего 			= Стр.Всего;
	КонецЦикла;

	Для каждого Стр Из Доходы Цикл
		НовСтрока = ТЗСвертка.Добавить();
		НовСтрока.Грузоперевозка 	= Стр.Грузоперевозка;
		НовСтрока.Номенклатура 		= Стр.Номенклатура;
		НовСтрока.СтавкаНДС 		= Стр.СтавкаНДС;
		НовСтрока.НДС 				= Стр.НДС*(-1);
		НовСтрока.Сумма 			= Стр.Сумма*(-1);
		НовСтрока.Всего 			= Стр.Всего*(-1);
		
	КонецЦикла;
	
	ТЗСвертка.Свернуть("Грузоперевозка,Номенклатура, СтавкаНДС", "НДС, Сумма, Всего");
	Для каждого Стр Из ТЗСвертка Цикл
		
		Движение = Движения.CW_ПеревыставлениеПоСтавкам.Добавить();
		Движение.Период         = Дата;
		Если Стр.Всего < 0 Тогда
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Коэффициент = -1;
		Иначе
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Коэффициент = 1;
		КонецЕсли; 
		Движение.Грузоперевозка = ?(ЗакрытиеПоЗаказу,Стр.Грузоперевозка,Аналитика);
		Движение.Номенклатура   = Стр.Номенклатура;
		Движение.Контрагент     = Контрагент;
		Движение.Договор        = Договор;
		Движение.СтавкаНДС      = Стр.СтавкаНДС;
		Движение.Всего	    	= Стр.Всего*Коэффициент;
		Движение.Сумма	      	= Стр.Сумма*Коэффициент;
		Движение.НДС	        = Стр.НДС*Коэффициент;
		
		//Подсистема.УчетПриложенийДоговоров
		Движение.ПриложениеКДоговору = ПриложениеКДоговору;
		//Подсистема.УчетПриложенийДоговоров
		
	КонецЦикла;
	
	ТЗСвертка.Свернуть("Грузоперевозка", "НДС, Сумма, Всего");
	
	ВалютаРегламентированногоУчетаРубль = ПолучитьФункциональнуюОпцию("CW_ВалютаРегламентированногоУчетаРубль");

	Если ВалютаРегламентированногоУчетаРубль Тогда
		Если (Вознаграждение.Количество() > 0) Тогда
			
			Если (ПараметрыДоговора.АвтоматическийРасчетВознаграждения) Тогда 
				
				Для каждого Стр Из ТЗСвертка Цикл
					Движение = Движения.CW_ВознаграждениеПоГрузоперевозкам.Добавить();
					Движение.Период         = Дата;
					Движение.Грузоперевозка = Стр.Грузоперевозка;
					Движение.Контрагент     = Контрагент;
					Движение.Договор        = Договор;
					Движение.Валюта         = ДС.КО.ВалютаРегламентированногоУчета;
					Движение.СтавкаНДС      = Вознаграждение[0].СтавкаНДС;
					Движение.База		    = -Стр.Всего;
					Движение.Всего_Валюта   = -Стр.Всего;
					Движение.Всего	    	= -Стр.Всего;
					Движение.Сумма	      	= -Стр.Сумма;
					Движение.НДС	        = -Стр.НДС;
					Движение.НДС_Валюта     = -Стр.НДС;
					
					//Подсистема.УчетПриложенийДоговоров
					Движение.ПриложениеКДоговору = ПриложениеКДоговору;
					//Подсистема.УчетПриложенийДоговоров
				КонецЦикла;
				
			КонецЕсли;	
			
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры

Функция ПроверкаНомеров()
	
	СтруктураПараметровБухУчета = Новый Структура;
	СтруктураПараметровБухУчета.Вставить("Договор", 				Договор);
	СтруктураПараметровБухУчета.Вставить("ПриложениеКДоговору",		ПриложениеКДоговору);
	
	ПараметрыБухгалтерскогоУчета = CW_Финансы.ПолучитьПарметрыВеденияБухгалтерскогоУчета(СтруктураПараметровБухУчета, Дата);
	
	Если НЕ ПараметрыБухгалтерскогоУчета.БухгалтерскийУчет Тогда
		
		Возврат(Истина);
		
	КонецЕсли; 
	
	ТребуетсяКонтрольАкта = Ложь;
	ТребуетсяКонтрольСФ = Ложь;
	
	// анализируем, что мы можем проверить
	
	Если (ДС.УП.ПорядокПрисвоенияНомеров = Перечисления.CW_ПорядокПрисвоенияИсходящихНомеров.СплошнаяНумерация
		ИЛИ ДС.УП.ПорядокПрисвоенияНомеров = Перечисления.CW_ПорядокПрисвоенияИсходящихНомеров.ВПределахДаты) Тогда
		
		ТребуетсяКонтрольАкта = Истина;
		Если (ТребуетсяКонтрольАкта) Тогда
			НомерАктаДляКонтроля = ?(ЗначениеЗаполнено(НомерАкта),НомерАкта,Номер);
			ДатаАктаДляКонтроля = ?(ЗначениеЗаполнено(ДатаАкта),ДатаАкта,Дата);
		КонецЕсли;  
		// --- 
		ТребуетсяКонтрольСФ = (ФормируетсяСчетФактура);
		Если (ТребуетсяКонтрольСФ) Тогда
			НомерСФДляКонтроля = ?(ЗначениеЗаполнено(НомерСчетаФактуры),НомерСчетаФактуры,Номер);
			ДатаСФДляКонтроля = ?(ЗначениеЗаполнено(ДатаСчетаФактуры),ДатаСчетаФактуры,?(ЗначениеЗаполнено(ДатаАкта),ДатаАкта,Дата));
		КонецЕсли; 
		
	КонецЕсли;
	
	Если (ДС.УП.ПорядокПрисвоенияНомеров = Перечисления.CW_ПорядокПрисвоенияИсходящихНомеров.НезависимаяНумерация) Тогда
		
		ТребуетсяКонтрольАкта = (ФормируетсяАкт И ЗначениеЗаполнено(НомерАкта) И ЗначениеЗаполнено(ДатаАкта));
		Если (ТребуетсяКонтрольАкта) Тогда
			НомерАктаДляКонтроля = НомерАкта;
			ДатаАктаДляКонтроля = ДатаАкта;
		КонецЕсли;
		ТребуетсяКонтрольСФ = (ФормируетсяСчетФактура И ЗначениеЗаполнено(НомерСчетаФактуры) И ЗначениеЗаполнено(ДатаСчетаФактуры));
		Если (ТребуетсяКонтрольСФ) Тогда
			НомерСФДляКонтроля = НомерСчетаФактуры;
			ДатаСФДляКонтроля = ДатаСчетаФактуры;
		КонецЕсли; 
		
	КонецЕсли; 
		
	// ---------------------------------------------------------------------------- 
	
	Если (ТребуетсяКонтрольАкта) Тогда
		
		НомерРеализацииУникальный = Ложь;
		Запрос = Новый Запрос("ВЫБРАТЬ
		                      |	РеализацияТоваровУслуг.Номер,
		                      |	РеализацияТоваровУслуг.Дата,
		                      |	РеализацияТоваровУслуг.Ссылка
		                      |ИЗ
		                      |	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		                      |ГДЕ
		                      |	РеализацияТоваровУслуг.Номер = &Номер
		                      |	И РеализацияТоваровУслуг.Ссылка <> &ВедомыйАкт
		                      |	И ГОД(РеализацияТоваровУслуг.Дата) = &Год");
		
		Запрос.УстановитьПараметр("Номер", НомерАктаДляКонтроля);
		Запрос.УстановитьПараметр("Год", Год(ДатаАктаДляКонтроля));
		Запрос.УстановитьПараметр("ВедомыйАкт", ВедомыйДокумент);
		
		ТЗ = Запрос.Выполнить().Выгрузить();
		
		Если ТЗ.Количество() = 0 Тогда
			
			НомерРеализацииУникальный = Истина;
			
		Иначе
			
			Сообщить("Обнаружены документы реализации: "+Символы.ПС+_сф.м_Представление(ТЗ.ВыгрузитьКолонку("Ссылка"),Символы.ПС));
			
		КонецЕсли;	
		
	Иначе
		
		НомерРеализацииУникальный = Истина;
		
	КонецЕсли; 
	// --- 
	Если (ТребуетсяКонтрольСФ) Тогда
		
		НомерСФУникальный = Ложь;
		Запрос = Новый Запрос("ВЫБРАТЬ
		|	СчетФактураВыданный.Ссылка
		|ИЗ
		|	Документ.СчетФактураВыданный КАК СчетФактураВыданный
		|ГДЕ
		|	СчетФактураВыданный.Номер = &Номер
		|	И ГОД(СчетФактураВыданный.Дата) = &Год
		|	И СчетФактураВыданный.ДокументОснование <> &ВедомыйАкт");
		
		Запрос.УстановитьПараметр("Номер", НомерСФДляКонтроля);
		Запрос.УстановитьПараметр("Год", Год(ДатаСФДляКонтроля));
		Запрос.УстановитьПараметр("ВедомыйАкт", ВедомыйДокумент);
		
		ТЗ = Запрос.Выполнить().Выгрузить();
		
		Если ТЗ.Количество() = 0 Тогда
			
			НомерСФУникальный = Истина;
			
		Иначе
			
			Сообщить("Обнаружены счета-фактуры: "+Символы.ПС+_сф.м_Представление(ТЗ.ВыгрузитьКолонку("Ссылка"),Символы.ПС));
			
		КонецЕсли;
		
	Иначе
		
		НомерСФУникальный = Истина;
		
	КонецЕсли; 
	
	// ---------------------------------------------------------------------------- 
	
	Возврат(НомерРеализацииУникальный И НомерСФУникальный);

КонецФункции

Функция НомерПодходит()
	
	НомерРеализацииУникальный = Ложь;
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	РеализацияТоваровУслуг.Номер
	                      |ИЗ
	                      |	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	                      |ГДЕ
	                      |	РеализацияТоваровУслуг.Номер = &Номер
	                      |	И РеализацияТоваровУслуг.Ссылка <> &ВедомыйАкт
	                      |	И ГОД(РеализацияТоваровУслуг.Дата) = &Год");
							  
	Запрос.УстановитьПараметр("Номер", Номер);
	Запрос.УстановитьПараметр("Год", Год(Дата));
	Запрос.УстановитьПараметр("ВедомыйАкт", ВедомыйДокумент);
	
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	Если ТЗ.Количество() = 0 Тогда
		НомерРеализацииУникальный = Истина;
	КонецЕсли;
	
	НомерСФУникальный = Ложь;
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	СчетФактураВыданный.Ссылка
	                      |ИЗ
	                      |	Документ.СчетФактураВыданный КАК СчетФактураВыданный
	                      |ГДЕ
	                      |	СчетФактураВыданный.Номер = &Номер
	                      |	И ГОД(СчетФактураВыданный.Дата) = &Год
	                      |	И СчетФактураВыданный.ДокументОснование <> &ВедомыйАкт");
							  
	Запрос.УстановитьПараметр("Номер", Номер);
	Запрос.УстановитьПараметр("Год", Год(Дата));
	Запрос.УстановитьПараметр("ВедомыйАкт", ВедомыйДокумент);
	
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	Если ТЗ.Количество() = 0 Тогда
		НомерСФУникальный = Истина;
	КонецЕсли;
	
	//НомерСчетаУникальный = Ложь;
	//Запрос = Новый Запрос("ВЫБРАТЬ
	//					  |	СчетНаОплатуПокупателю.Ссылка
	//					  |ИЗ
	//					  |	Документ.СчетНаОплатуПокупателю КАК СчетНаОплатуПокупателю
	//					  |ГДЕ
	//					  |	СчетНаОплатуПокупателю.Номер = &Номер
	//					  |	И ГОД(СчетНаОплатуПокупателю.Дата) = &Год
	//					  |	И СчетНаОплатуПокупателю.Ссылка <> &ВедомыйСчет");
	//						  
	//Запрос.УстановитьПараметр("Номер", Номер);
	//Запрос.УстановитьПараметр("Год", Год(Дата));
	//Запрос.УстановитьПараметр("ВедомыйСчет", ВедомыйДокументСчет);
	//
	//ТЗ = Запрос.Выполнить().Выгрузить();
	//
	//Если ТЗ.Количество() = 0 Тогда
	//	НомерСчетаУникальный = Истина;
	//КонецЕсли;
	
	Если НомерРеализацииУникальный И НомерСФУникальный Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;	

КонецФункции

// получаем параметры договора и константы, помещаем в доп. свойства
Процедура СформироватьОбщиеПараметры(Знач СписокПараметров=Неопределено,ИнтерактивныйРежим = Истина) Экспорт 
	
	CW_ОбщиеПараметры.СформироватьОбщиеПараметры(ЭтотОбъект,СписокПараметров,ИнтерактивныйРежим);
	ДС = ДополнительныеСвойства;
	
КонецПроцедуры

// проверка общих параметров
Функция ЗаполненыОбщиеПараметры() Экспорт 
	// --- 
	
	Возврат(CW_ОбщиеПараметры.ОбщиеПараметрыЗаполнены(ЭтотОбъект));
	
	// --- 
КонецФункции

Функция ПроверитьЗакрытиеГрузоперевозок() Экспорт 
	// --- 
	
	ДатаЗакрытия = CW_Мониторинг.ПолучитьДатуЗакрытия(Аналитика);
	Если ДатаЗакрытия <> Дата(1,1,1) Тогда
		
		Возврат(Ложь);
		
	Иначе
		
		Возврат(Истина);
		
	КонецЕсли; 
	
	// --- 
КонецФункции

#КонецЕсли
